neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32L5.c

#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <math.h>
#include <time.h>

#include "soc.h"

#include "DMA/DMA.h"

#include "NeonRTOS.h"

#ifdef STM32L5

#include "DMA_STM32_Index.h"

#include "DMA_STM32.h"

//#include "CAN/Device/STM32/CAN_STM32.h"
#include "I2C/Device/STM32/I2C_Master_STM32.h"
#include "SPI/Device/STM32/SPI_Master_STM32.h"
#include "UART/Device/STM32/UART_STM32.h"

#define DMA_CHANNEL_LOCK(channel_index) if (NeonRTOS_LockObjLock(&DMA_Channel_Mutex[(channel_index)], DMA_WAIT_ALLOCATED_TIMEOUT) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }
#define DMA_CHANNEL_UNLOCK(channel_index) if (NeonRTOS_LockObjUnlock(&DMA_Channel_Mutex[(channel_index)]) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }

static const hwDMA_Channel_Index UART_DMA_Channel_Map[hwUART_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined (UART1_BASE) || defined(USART1_BASE)
    {hwDMA_Channel_Index_1, hwDMA_Channel_Index_2},
#endif
#if defined (UART2_BASE) || defined(USART2_BASE)
    {hwDMA_Channel_Index_3, hwDMA_Channel_Index_4},
#endif
#if defined (UART3_BASE) || defined(USART3_BASE)
    {hwDMA_Channel_Index_5, hwDMA_Channel_Index_6},
#endif
#if defined (UART4_BASE) || defined(USART4_BASE)
    {hwDMA_Channel_Index_7, hwDMA_Channel_Index_8},
#endif
#if defined (UART5_BASE) || defined(USART5_BASE)
    {hwDMA_Channel_Index_9, hwDMA_Channel_Index_10},
#endif
#if defined (LPUART1_BASE)
    {hwDMA_Channel_Index_11, hwDMA_Channel_Index_12},
#endif
};

static const hwDMA_Channel_Index SPI_DMA_Channel_Map[hwSPI_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined(SPI1_BASE)
    {hwDMA_Channel_Index_1, hwDMA_Channel_Index_2},
#endif
#if defined(SPI2_BASE)
    {hwDMA_Channel_Index_3, hwDMA_Channel_Index_4},
#endif
#if defined(SPI3_BASE)
    {hwDMA_Channel_Index_5, hwDMA_Channel_Index_6},
#endif
};

static const hwDMA_Channel_Index I2C_DMA_Channel_Map[hwI2C_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined(I2C1_BASE)
    {hwDMA_Channel_Index_7, hwDMA_Channel_Index_8},
#endif
#if defined(I2C2_BASE)
    {hwDMA_Channel_Index_9, hwDMA_Channel_Index_10},
#endif
#if defined(I2C3_BASE)
    {hwDMA_Channel_Index_11, hwDMA_Channel_Index_12},
#endif
#if defined(I2C4_BASE)
    {hwDMA_Channel_Index_13, hwDMA_Channel_Index_14},
#endif
};

DMA_TypeDef * DMA_Map_Soc_Base(hwDMA_Channel_Index index)
{
    switch(index)
    {
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
        case hwDMA_Channel_Index_1:
#endif
#if defined (DMA1_Channel2)
        case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
        case hwDMA_Channel_Index_3:
#endif
#if defined (DMA1_Channel4)
        case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
        case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
        case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
        case hwDMA_Channel_Index_7:
#endif
#if defined (DMA1_Channel8)
        case hwDMA_Channel_Index_8:
#endif
                return DMA1;
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Channel1)
        case hwDMA_Channel_Index_9:
#endif
#if defined (DMA2_Channel2)
        case hwDMA_Channel_Index_10:
#endif
#if  defined (DMA2_Channel3)
        case hwDMA_Channel_Index_11:
#endif
#if defined (DMA2_Channel4)
        case hwDMA_Channel_Index_12:
#endif
#if defined (DMA2_Channel5)
        case hwDMA_Channel_Index_13:
#endif
#if defined (DMA2_Channel6)
        case hwDMA_Channel_Index_14:
#endif
#if defined (DMA2_Channel7)
        case hwDMA_Channel_Index_15:
#endif
#if defined (DMA2_Channel8)
        case hwDMA_Channel_Index_16:
#endif
                return DMA2;
#endif
        default:
                break;
    }
    return NULL;
}

DMA_Channel_TypeDef * DMA_Map_Soc_Channel_Base(hwDMA_Channel_Index index)
{
    switch(index)
    {
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
        case hwDMA_Channel_Index_1: return DMA1_Channel1;
#endif
#if defined (DMA1_Channel2)
        case hwDMA_Channel_Index_2: return DMA1_Channel2;
#endif
#if defined (DMA1_Channel3)
        case hwDMA_Channel_Index_3: return DMA1_Channel3;
#endif
#if defined (DMA1_Channel4)
        case hwDMA_Channel_Index_4: return DMA1_Channel4;
#endif
#if defined (DMA1_Channel5)
        case hwDMA_Channel_Index_5: return DMA1_Channel5;
#endif
#if defined (DMA1_Channel6)
        case hwDMA_Channel_Index_6: return DMA1_Channel6;
#endif
#if defined (DMA1_Channel7)
        case hwDMA_Channel_Index_7: return DMA1_Channel7;
#endif
#if defined (DMA1_Channel8)
        case hwDMA_Channel_Index_8: return DMA1_Channel8;
#endif
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Channel1)
        case hwDMA_Channel_Index_9: return DMA2_Channel1;
#endif
#if defined (DMA2_Channel2)
        case hwDMA_Channel_Index_10: return DMA2_Channel2;
#endif
#if defined (DMA2_Channel3)
        case hwDMA_Channel_Index_11: return DMA2_Channel3;
#endif
#if defined (DMA2_Channel4)
        case hwDMA_Channel_Index_12: return DMA2_Channel4;
#endif
#if defined (DMA2_Channel5)
        case hwDMA_Channel_Index_13: return DMA2_Channel5;
#endif
#if defined (DMA2_Channel6)
        case hwDMA_Channel_Index_14: return DMA2_Channel6;
#endif
#if defined (DMA2_Channel7)
        case hwDMA_Channel_Index_15: return DMA2_Channel7;
#endif
#if defined (DMA2_Channel8)
        case hwDMA_Channel_Index_16: return DMA2_Channel8;
#endif
#endif
        default: break;
    }
    return NULL;
}

static void DMA_IRQ_Handler(hwDMA_Channel_Index index)
{
        if(index>=hwDMA_Channel_Index_MAX)
        {
                return;
        }

        HAL_DMA_IRQHandler(&g_dma[index]);
}

#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
void DMA1_Channel1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_1); }
#endif
#if defined (DMA1_Channel2)
void DMA1_Channel2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_2); }
#endif
#if defined (DMA1_Channel3)
void DMA1_Channel3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_3); }
#endif
#if defined (DMA1_Channel4)
void DMA1_Channel4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_4); }
#endif
#if defined (DMA1_Channel5)
void DMA1_Channel5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_5); }
#endif
#if defined (DMA1_Channel6)
void DMA1_Channel6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_6); }
#endif
#if defined (DMA1_Channel7)
void DMA1_Channel7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_7); }
#endif
#if defined (DMA1_Channel8)
void DMA1_Channel8_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_8); }
#endif
#endif //DMA1_BASE

#if defined (DMA2_BASE)
#if defined (DMA2_Channel1)
void DMA2_Channel1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_9); }
#endif
#if defined (DMA2_Channel2)
void DMA2_Channel2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_10); }
#endif
#if defined (DMA2_Channel3)
void DMA2_Channel3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_11); }
#endif
#if defined (DMA2_Channel4)
void DMA2_Channel4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_12); }
#endif
#if defined (DMA2_Channel5)
void DMA2_Channel5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_13); }
#endif
#if defined (DMA2_Channel6)
void DMA2_Channel6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_14); }
#endif
#if defined (DMA2_Channel7)
void DMA2_Channel7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_15); }
#endif
#if defined (DMA2_Channel8)
void DMA2_Channel8_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_16); }
#endif
#endif //DMA2_BASE

void DMA_Clock_Enable()
{
#if defined (DMA1_BASE)
         __HAL_RCC_DMA1_CLK_ENABLE();
#endif //DMA1_BASE

#if defined (DMA2_BASE)
        __HAL_RCC_DMA2_CLK_ENABLE();
#endif //DMA2_BASE

#if defined(DMAMUX1)
    __HAL_RCC_DMAMUX1_CLK_ENABLE();
#endif
}

